## Corey Solitaire
### advancecd_dataframes
#### 8/14/2020

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
plt.rc('figure', figsize=(12, 6))
from pydataset import data

In [2]:
"""
Test for SQL import and env.py
"""
from env import host, user, password

url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [3]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [7]:
# Big Test, that Passed...

pd.read_sql("""
SELECT CONCAT(employees.first_name, " ", employees.last_name) AS "Employee Name", departments.dept_name AS "Department Name", manager_name AS "Manager Name"
FROM employees
    JOIN dept_emp
        ON employees.emp_no = dept_emp.emp_no
    JOIN departments
        ON dept_emp.dept_no = departments.dept_no
    JOIN dept_manager
        ON dept_manager.dept_no = dept_emp.dept_no
-- The following subquery is a table that connects the current department manager name to their emp_no and its alias is manager_names

    JOIN(
        SELECT employees.emp_no, CONCAT(employees.first_name, " ", employees.last_name) AS manager_name
            FROM employees
                JOIN dept_manager
                    ON employees.emp_no = dept_manager.emp_no AND dept_manager.to_date > curdate()
    ) AS manager_names
WHERE dept_manager.to_date > curdate()
    AND dept_emp.to_date > curdate()
    AND dept_manager.emp_no = manager_names.emp_no;""", url)

              Employee Name   Department Name       Manager Name
0       Cristinel Bouloucos         Marketing  Vishwani Minakawa
1          Berhard McFarlin         Marketing  Vishwani Minakawa
2               Yucel Auria         Marketing  Vishwani Minakawa
3         Karoline Cesareni         Marketing  Vishwani Minakawa
4            Nikolaos Llado         Marketing  Vishwani Minakawa
...                     ...               ...                ...
240119       Aloke Wuwongse  Customer Service    Yuchang Weedman
240120      Masako Angiulli  Customer Service    Yuchang Weedman
240121  Chuanti Riesenhuber  Customer Service    Yuchang Weedman
240122       Ronghao Morrow  Customer Service    Yuchang Weedman
240123        Pohua Sichman  Customer Service    Yuchang Weedman

[240124 rows x 3 columns]

# Advanced Dataframes Exercises

In [ ]:
"""
mpg = data('mpg') # load the dataset and store it in a variable
# data('mpg', show_doc=True) # view the documentation for the dataset
"""

### 1. Load the mpg dataset. Read the documentation for it, and use the data to answer these questions:

In [9]:
mpg_df = data('mpg')
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [ ]:
# On average, which manufacturer has the best miles per gallon

In [ ]:
# How many different manufacturers are there?

In [ ]:
# How many different models are there?

In [ ]:
# Do automatic or manual cars have better miles per gallon?

### 2. Joining and Merging

In [ ]:
# Copy the users and roles dataframes from the examples above. What do you think a right join would look like?

In [ ]:
# An outer join?

In [ ]:
# What happens if you drop the foreign keys from the dataframes and try to merge them?

### 3. Getting data from SQL databases

In [ ]:
# Create a function named get_db_url. It should accept a 
# username, hostname, password, and database name and return a url formatted like in the examples in this lesson.

In [ ]:
# Use your function to obtain a connection to the employees database.

In [ ]:
# Once you have successfully run a query:
#  - Intentionally make a typo in the database url. What kind of error message do you see?

In [ ]:
#   -Intentionally make an error in your SQL query. What does the error message look like?

In [ ]:
# Read the employees and titles tables into two separate dataframes

In [ ]:
# Visualize the number of employees with each title.

In [ ]:
# Join the employees and titles dataframes together.

In [ ]:
# Visualize how frequently employees change titles.

In [ ]:
# For each title, find the hire date of the employee that was hired most recently with that title.

In [ ]:
# Write the code necessary to create a cross tabulation of the number of titles by department. 
#  (Hint: this will involve a combination of SQL and python/pandas code)

### 4. Use your get_db_url function to help you explore the data from the chipotle database. Use the data to answer the following questions:

In [ ]:
# What is the total price for each order?

In [ ]:
# What are the most popular 3 items?

In [ ]:
# Which item has produced the most revenue?